# NewGBXMLImportOptions Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
Application..::..NewGBXMLImportOptions Method
Application Class See Also
---
Creates Green-Building XML Import options.
**Namespace:** Autodesk.Revit.Creation**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public GBXMLImportOptions NewGBXMLImportOptions()
```

Visual Basic
---
```text
Public Function NewGBXMLImportOptions As GBXMLImportOptions
```

Visual C++
---
```text
public:
GBXMLImportOptions^ NewGBXMLImportOptions()
```

# See Also
Application Class
Autodesk.Revit.Creation Namespace